pi * r^2$, trong đó $r$ là bán kính.",
    
    "nguyen_ly_thien_van": "Thiên văn học nghiên cứu các thiên thể, vũ trụ và các hiện tượng tự nhiên bên ngoài bầu khí quyển Trái Đất.",
    "nen_van_minh_lon_nhat": "Nền văn minh Lưỡng Hà (Mesopotamia) là một trong những nền văn minh cổ đại đầu tiên trên thế giới.",
    "su_kien_trang_den": "Trận Điện Biên Phủ năm 1954 là một sự kiện quan trọng, kết thúc chiến tranh Đông Dương và dẫn đến chia cắt Việt Nam.",
    "giao_thuc_http": "HTTP (HyperText Transfer Protocol) là giao thức cơ bản được sử dụng để truyền tải dữ liệu trên World Wide Web.",
    "trung_tam_ai_viet_nam": "Việt Nam đang tập trung phát triển AI tại các trung tâm lớn như Hà Nội và TP. Hồ Chí Minh.",
    "cong_nghe_5g": "5G là thế hệ mạng di động thứ năm, cung cấp tốc độ truyền dữ liệu nhanh hơn và độ trễ thấp hơn nhiều so với 4G.",
    "an_toan_thong_tin": "An toàn thông tin bao gồm các biện pháp bảo vệ hệ thống máy tính và dữ liệu khỏi các mối đe dọa kỹ thuật số.",
    "phong_trao_van_hoc": "Phong trào Thơ Mới (1932-1945) là một bước ngoặt lớn trong văn học Việt Nam, phá vỡ thể thơ truyền thống.",
    "cac_loai_hinh_nghe_thuat": "Các loại hình nghệ thuật chính bao gồm: Hội họa, Điêu khắc, Âm nhạc, Văn học, Điện ảnh, Sân khấu và Kiến trúc.",
    "lich_su_dau_ti_tien_giay": "Tiền giấy được phát minh lần đầu tiên ở Trung Quốc vào thế kỷ thứ 7, trong thời nhà Đường.",
    "kinh_te_thi_truong": "Kinh tế thị trường là hệ thống kinh tế nơi giá cả và sản xuất được quyết định chủ yếu bởi cung và cầu.",
    "nguyen_ly_may_phat_dien": "Máy phát điện hoạt động dựa trên nguyên lý cảm ứng điện từ (Faraday) để biến đổi cơ năng thành điện năng.",
    "ly_thuyet_ev_toan_hoc": "Giá trị kỳ vọng (Expected Value - EV) là tổng các tích của giá trị có thể xảy ra nhân với xác suất xảy ra của giá trị đó.",
    "cac_ky_quan_the_gioi": "Bảy kỳ quan thế giới cổ đại bao gồm Kim tự tháp Giza, Vườn treo Babylon, Tượng thần Zeus ở Olympia, v.v.",
    "khoa_hoc_ve_bien": "Hải dương học là ngành khoa học nghiên cứu về biển cả, bao gồm các sinh vật biển, dòng hải lưu, và đáy biển.",
    "suc_khoe_tam_than": "Sức khỏe tâm thần quan trọng không kém sức khỏe thể chất và cần được chăm sóc thông qua nghỉ ngơi và hỗ trợ xã hội.",
    "van_hoa_uong_tra": "Uống trà là một nét văn hóa lâu đời ở Việt Nam, thể hiện sự tĩnh tại và hiếu khách.",
    "am_thuc_mien_bac": "Ẩm thực miền Bắc nổi tiếng với sự tinh tế, thanh tao, ít dầu mỡ và vị vừa phải.",
    "am_thuc_mien_nam": "Ẩm thực miền Nam có xu hướng ngọt, đậm đà, sử dụng nhiều nước cốt dừa và đường.",
    "am_thuc_mien_trung": "Ẩm thực miền Trung cay và mặn hơn, với nhiều món ăn mang tính cung đình.",
    "cong_cu_phan_tich_du_lieu": "Excel, Python (với thư viện Pandas) và R là những công cụ phổ biến nhất để phân tích dữ liệu.",
    "khai_niem_ve_big_data": "Big Data (Dữ liệu lớn) là tập hợp dữ liệu có khối lượng lớn, tốc độ nhanh và đa dạng mà các công cụ truyền thống khó xử lý.",
    "ngon_ngu_lap_trinh_c": "Ngôn ngữ C là nền tảng của nhiều hệ điều hành và ngôn ngữ lập trình khác, nổi tiếng về tốc độ và hiệu quả.",
    "su_khac_biet_giua_web_10_va_web_30": "Web 1.0 tĩnh (chỉ đọc), Web 2.0 tương tác (mạng xã hội), và Web 3.0 phi tập trung (Blockchain, AI).",
    "the_he_may_tinh_dau_tien": "Máy tính thế hệ đầu tiên sử dụng ống chân không, rất lớn, chậm và tốn nhiều năng lượng.",
    "dao_tao_ai_la_gi": "Đào tạo AI là quá trình cung cấp dữ liệu cho mô hình để nó học cách nhận dạng mẫu, dự đoán hoặc ra quyết định.",
    "ly_thuyet_mau_sac": "Lý thuyết màu sắc nghiên cứu cách con người nhận thức màu sắc và cách phối màu để tạo ra hiệu ứng thị giác.",
    "cac_loai_hinh_kinh_doanh": "Các loại hình kinh doanh phổ biến bao gồm Công ty Cổ phần (JSC), Công ty TNHH (LLC) và Doanh nghiệp Tư nhân.",
    "dinh_nghia_ve_hap_dan": "Lực hấp dẫn là lực tương tác giữa các vật thể có khối lượng, làm cho chúng hút nhau.",
    "nguyen_tac_cua_quang_hoc": "Quang học nghiên cứu ánh sáng, bao gồm sự phản xạ, khúc xạ và giao thoa.",
    "nguon_goc_cua_vu_tru": "Thuyết Vụ Nổ Lớn (Big Bang) là mô hình khoa học giải thích sự hình thành và phát triển của vũ trụ từ một điểm kỳ dị.",
    "thuyet_tien_hoa": "Thuyết tiến hóa của Charles Darwin giải thích rằng các loài sinh vật thay đổi theo thời gian thông qua quá trình chọn lọc tự nhiên.",
    "cau_truc_trai_dat": "Trái Đất có ba lớp chính: Vỏ, Manti (áo ngoài và áo trong) và Lõi (lõi ngoài lỏng, lõi trong rắn).",
    "chu_ky_nuoc": "Chu kỳ nước là quá trình nước chuyển động liên tục trên, trong và dưới bề mặt Trái Đất (bốc hơi, ngưng tụ, giáng thủy).",
    "cong_thuc_dien_ap": "Công thức tính điện áp trong mạch điện là $V = I * R$, trong đó $V$ là điện áp, $I$ là cường độ dòng điện, và $R$ là điện trở.",
    "phuong_trinh_bac_hai": "Phương trình bậc hai có dạng tổng quát là $ax^2 + bx + c = 0$, với $a \\ne 0$.",
    "dai_so_tuyen_tinh": "Đại số tuyến tính là ngành toán học nghiên cứu về vector, không gian vector và phép biến đổi tuyến tính.",
    "nen_van_hoa_dong_son": "Văn hóa Đông Sơn (khoảng 1000 TCN – thế kỷ 1 SCN) nổi tiếng với các hiện vật bằng đồng, đặc biệt là Trống đồng Đông Sơn.",
    "dia_danh_noi_tieng_the_gioi": "Vạn Lý Trường Thành ở Trung Quốc, Đấu trường La Mã ở Ý và Machu Picchu ở Peru là các địa danh nổi tiếng.",
    "lich_su_thanh_pho_london": "London được thành lập bởi người La Mã vào khoảng năm 43 SCN, ban đầu có tên là Londinium.",
    "nguyen_ly_may_tinh": "Máy tính hoạt động theo chu trình: Nhận dữ liệu (Input), Xử lý (Process), và Xuất dữ liệu (Output).",
    "ngon_ngu_lap_trinh_python": "Python là ngôn ngữ lập trình bậc cao, dễ đọc, được ưa chuộng trong phát triển web, khoa học dữ liệu và tự động hóa.",
    "thu_vien_react": "ReactJS là một thư viện JavaScript được phát triển bởi Facebook, dùng để xây dựng giao diện người dùng (UI) hiệu quả.",
    "giao_thuc_https": "HTTPS là phiên bản bảo mật của HTTP, sử dụng SSL/TLS để mã hóa dữ liệu truyền giữa trình duyệt và máy chủ.",
    "chuc_nang_cua_cache": "Cache là một vùng nhớ tốc độ cao, được sử dụng để lưu trữ dữ liệu truy cập thường xuyên, giúp giảm thời gian truy xuất.",
    "khai_niem_ve_cloud_computing": "Điện toán đám mây (Cloud Computing) là việc cung cấp các dịch vụ tính toán (server, lưu trữ, mạng, phần mềm) qua Internet.",
    "tranh_dan_gian_viet_nam": "Tranh Đông Hồ là loại hình tranh dân gian nổi tiếng của Việt Nam, thường được in trên giấy dó.",
    "dan_toc_viet_nam": "Việt Nam có 54 dân tộc anh em, dân tộc Kinh chiếm đa số.",
    "cach_nuoi_duong_cay": "Để nuôi cây xanh tốt, cần đảm bảo đủ ánh sáng, nước, chất dinh dưỡng và môi trường đất phù hợp.",
    "tac_dung_cua_protein": "Protein cần thiết cho việc xây dựng, sửa chữa các mô và tạo ra enzyme, hormone quan trọng trong cơ thể.",
    "cac_loai_che_do_an": "Các chế độ ăn phổ biến bao gồm ăn chay (Vegetarian), ăn kiêng (Keto), và ăn thô (Raw food).",
    "nguyen_ly_tai_chinh": "Tài chính là ngành nghiên cứu về tiền tệ, quản lý rủi ro và quyết định đầu tư.",
    "lai_suat_kep": "Lãi suất kép (Compound Interest) là lãi được tính trên cả vốn gốc và tổng số lãi đã tích lũy từ các kỳ trước.",
    "triet_hoc_aristotle": "Aristotle là một triết gia Hy Lạp cổ đại, là học trò của Plato và thầy của Alexander Đại đế.",
    "dieu_khien_tu_dong": "Điều khiển tự động là ngành kỹ thuật sử dụng hệ thống điều khiển để quản lý và vận hành máy móc mà không cần sự can thiệp trực tiếp của con người.",
    "ky_thuat_may_hoc_la_gi": "Machine Learning (Học máy) là một lĩnh vực của AI, cho phép máy tính tự học từ dữ liệu mà không cần lập trình rõ ràng.",
    "khac_biet_giua_machine_learning_va_deep_learning": "Deep Learning (Học sâu) là một tập hợp con của Machine Learning, sử dụng mạng nơ-ron nhân tạo với nhiều lớp để xử lý dữ liệu phức tạp.",
    "thuat_toan_sap_xep": "Các thuật toán sắp xếp phổ biến là Bubble Sort, Merge Sort, và Quick Sort.",
    "cau_truc_du_lieu": "Cấu trúc dữ liệu là cách tổ chức và lưu trữ dữ liệu để truy cập và sửa đổi một cách hiệu quả.",
    "he_dieu_hanh_linux": "Linux là một hệ điều hành mã nguồn mở, được sử dụng rộng rãi trên server, siêu máy tính và thiết bị nhúng.",
    "co_che_khop_noi_thuy_luc": "Khớp nối thủy lực truyền mô-men xoắn bằng cách sử dụng chất lỏng (thường là dầu) thay vì liên kết cơ học.",
    "nguyen_ly_phanh_abs": "Hệ thống phanh ABS (Anti-lock Braking System) ngăn bánh xe bị bó cứng khi phanh gấp, giúp người lái duy trì khả năng kiểm soát phương tiện.",
    "he_sinh_thai_rung": "Hệ sinh thái rừng là một cộng đồng sinh vật (cây, động vật, vi sinh vật) tương tác với môi trường vật lý (đất, nước, không khí).",
    "su_kien_toan_cau": "Sự kiện Đại Suy Thoái (Great Depression) vào thập niên 1930 là một cuộc khủng hoảng kinh tế toàn cầu nghiêm trọng.",
    "viet_nam_gia_nhap_wto": "Việt Nam chính thức gia nhập Tổ chức Thương mại Thế giới (WTO) vào ngày 11 tháng 01 năm 2007.",
    "muc_dich_cua_thue": "Thuế là khoản đóng góp bắt buộc mà cá nhân hoặc tổ chức nộp cho nhà nước để tài trợ cho các dịch vụ công cộng.",
    "loi_ich_cua_tap_the_duc": "Tập thể dục thường xuyên giúp tăng cường sức khỏe tim mạch, kiểm soát cân nặng và cải thiện tâm trạng.",
    "phuong_phap_giam_stress": "Các phương pháp giảm stress hiệu quả bao gồm thiền, tập yoga, ngủ đủ giấc và dành thời gian cho sở thích cá nhân.",
    "vai_tro_cua_vitamin_a": "Vitamin A rất cần thiết cho thị lực, chức năng miễn dịch và sự phát triển của tế bào.",
    "van_hoc_lang_man": "Văn học lãng mạn (Romanticism) là phong trào nghệ thuật, văn học và trí tuệ vào cuối thế kỷ 18, nhấn mạnh cảm xúc và chủ nghĩa cá nhân.",
    "nghe_thuat_mua_roi_nuoc": "Múa rối nước là một loại hình nghệ thuật dân gian độc đáo của Việt Nam, được biểu diễn trên mặt nước.",
    "trang_phuc_dan_toc": "Áo dài là trang phục truyền thống nổi tiếng của phụ nữ Việt Nam, thể hiện sự duyên dáng và thanh lịch.",
    "su_kien_dao_vang_california": "Cơn sốt đào vàng California (California Gold Rush) bắt đầu năm 1848, dẫn đến sự phát triển nhanh chóng của California.",
    "ly_do_co_thuy_trieu": "Thủy triều là hiện tượng nước biển dâng lên và rút xuống, chủ yếu do lực hấp dẫn của Mặt Trăng và Mặt Trời.",
    "cong_nghe_in_3d": "In 3D là quá trình tạo ra các vật thể ba chiều bằng cách đắp chồng các lớp vật liệu liên tiếp theo mô hình kỹ thuật số.",
    "khai_niem_ve_metaverse": "Metaverse là một mạng lưới các thế giới ảo 3D được kết nối, nơi người dùng có thể tương tác với nhau và với môi trường ảo.",
    "chuc_nang_cua_vpn": "VPN (Virtual Private Network) tạo ra một kết nối an toàn, được mã hóa qua Internet, giúp bảo vệ quyền riêng tư và ẩn danh trực tuyến.",
    "giai_doan_robot": "Robot thế hệ đầu tiên là các máy móc đơn giản được lập trình để thực hiện các nhiệm vụ lặp đi lặp lại.",
    "luat_moore": "Luật Moore là quan sát rằng số lượng bóng bán dẫn trên một mạch tích hợp sẽ tăng gấp đôi khoảng mỗi hai năm.",
    "tien_dien_tu": "Tiền điện tử (Cryptocurrency) là tiền tệ kỹ thuật số hoặc ảo được bảo mật bằng mật mã, khiến việc giả mạo trở nên khó khăn.",
    "vai_tro_cua_blockchain": "Blockchain có vai trò quan trọng trong việc tạo ra các hệ thống minh bạch, an toàn và không cần bên thứ ba đáng tin cậy.",
    "nguon_goc_cua_pizza": "Pizza hiện đại có nguồn gốc từ Naples, Ý vào cuối thế kỷ 18 và đầu thế kỷ 19.",
    "van_hoa_cau_luong": "Cải lương là loại hình nghệ thuật sân khấu truyền thống của miền Nam Việt Nam, kết hợp ca hát, diễn xuất và âm nhạc."
}